import os
import shutil
from pathlib import Path
from tempfile import NamedTemporaryFile

import yadisk
import re
import importlib

from docx import Document
# from publisher.settings import YADISK_TOKEN, YADISK_BASE_PATH, YADISK_MAILINGS_SEND_PROGRAM_PATH, YADISK_ORIGINALS_THESIS_PATH, YADISK_ORIGINALS_ARTICLE_PATH, YADISK_THESIS_PATH, TEMP_IMG_DIR, TEMP_FILE_DIR, YADISK_ARTICLE_PATH, TEMP_FILE_DIR



if __name__ == "__main__":
    data = [
        {
            "section": "Реклама, пиар и медиакоммуникации: современные вызовы и стратегии решения",
            "moderator": {
                "degree": "к.ф.н.",
                "academic_title": "доцент",
                "job_title": None,
                "job": "ДКМ ШИГН ДВФУ",
                "name": "Баринова Ксения Владимировна"
            },
            "articles": [
                {
                    "title": "Актуальные практики книгораспространения Дальнем на Востоке",
                    "authors": "Меркурьев М.А., Савушкина А.А.",
                    "adviser": {
                        "name": "Баринова К.В.",
                        "info": "к.ф.н., доцент ДКМ ШИГН ДВФУ"
                    }
                },
                {
                    "title": "Реклама великая и могучая: современные вызовы и стратегии решения",
                    "authors": "Кильгановская Е.Р.",
                    "adviser": {
                        "name": "Лыкова Т.Д.",
                        "info": "к.эконом.н., доцент ДКМ ШИГН ДВФУ"
                    }
                },
                {
                    "title": "Ужасы медиа: современные вызовы и стратегии решения",
                    "authors": "Шаповал А.С.",
                    "adviser": {
                        "name": "Баринова К.В.",
                        "info": "к.ф.н., доцент ДКМ ШИГН ДВФУ"
                    }
                }
            ]
        },
        {
            "section": "Актуальные проблемы археологии",
            "moderator": {
                "degree": "к.ф.н.",
                "academic_title": "доцент",
                "job_title": None,
                "job": "ДКМ ШИГН ДВФУ",
                "name": "Баринова Ксения Владимировна"
            },
            "articles": [
                {
                    "title": "Актуальные практики книгораспространения Дальнем на Востоке",
                    "authors": "Меркурьев М.А., Савушкина А.А.",
                    "adviser": {
                        "name": "Баринова К.В.",
                        "info": "к.ф.н., доцент ДКМ ШИГН ДВФУ"
                    }
                },
                {
                    "title": "Реклама великая и могучая: современные вызовы и стратегии решения",
                    "authors": "Кильгановская Е.Р.",
                    "adviser": {
                        "name": "Лыкова Т.Д.",
                        "info": "к.эконом.н., доцент ДКМ ШИГН ДВФУ"
                    }
                },
                {
                    "title": "Ужасы медиа: современные вызовы и стратегии решения",
                    "authors": "Шаповал А.С.",
                    "adviser": {
                        "name": "Баринова К.В.",
                        "info": "к.ф.н., доцент ДКМ ШИГН ДВФУ"
                    }
                }
            ]
        },
        {
            "section": "Актуальные проблемы физической культуры, спортивного менеджмента и физической реабилитации",
            "moderator": {
                "degree": "к.ф.н.",
                "academic_title": "доцент",
                "job_title": None,
                "job": "ДКМ ШИГН ДВФУ",
                "name": "Баринова Ксения Владимировна"
            },
            "articles": [
                {
                    "title": "Актуальные практики книгораспространения Дальнем на Востоке",
                    "authors": "Меркурьев М.А., Савушкина А.А.",
                    "adviser": {
                        "name": "Баринова К.В.",
                        "info": "к.ф.н., доцент ДКМ ШИГН ДВФУ"
                    }
                },
                {
                    "title": "Актуальные проблемы физической культуры, спортивного менеджмента и физической реабилитации",
                    "authors": "Кильгановская Е.Р.",
                    "adviser": {
                        "name": "Лыкова Т.Д.",
                        "info": "к.эконом.н., доцент ДКМ ШИГН ДВФУ"
                    }
                },
                {
                    "title": "Ужасы медиа: современные вызовы и стратегии решения",
                    "authors": "Шаповал А.С.",
                    "adviser": {
                        "name": "Баринова К.В.",
                        "info": "к.ф.н., доцент ДКМ ШИГН ДВФУ"
                    }
                }
            ]
        }
    ]
    OPENED_SECTIONS = [
        "Реклама, пиар и медиакоммуникации: современные вызовы и стратегии решения",
        "Массовая коммуникация и окружающий мир",
        "Общество на современном этапе: явления, тренды, процессы",
        "Актуальные проблемы археологии",
        "Актуальные проблемы истории",
        "Актуальные проблемы психологии ",
        "Конфликтология, медиация и социальное согласие в эпоху глобализации",
        "Актуальные проблемы физической культуры, спортивного менеджмента и физической реабилитации",
        "Актуальные проблемы развития современного искусства и культуры",
        "Актуальные проблемы философии",
        "Современные тренды дизайна",
        "Православная теология в контексте современной гуманитаристики",
        "Теология и религиоведение: опыт осмысления религиозных культур и субкультур"
    ]
