from datetime import datetime

# Allow (True) / Reject (False) new users to register
REGISTRATION_OPEN = True

# Allow (True) / Reject (False) to compose documents without any sources
ALLOW_NO_SOURCE = True

# Enable to overwrite advisers.academic_title to "ученое звание отсутствует" if None
OVERWRITE_ACADEMIC_TITLE = False

# # Enable authors to confirm participation in conference. Set to True when program is ready
# CONFIRM_PARTICIPATION = False

# Adds program download to index page. Enable when program is ready
PROGRAM_READY = False

# Dictionary of allowed education levels in form { name of level: max number of courses } (99 - for not limited)
EDUCATION_LEVELS = {
    "Бакалавриат": 4,
    "Магистратура": 2,
    "Специалитет": 6,
    "Аспирантура": 4,
    "Ординатура": 99,
    "Докторантура": 99,
    "Кандидат наук": 99
}

# Default education level of author
DEFAULT_LEVEL = "Бакалавриат"

# Maximum characters length of title and it`s translation
TITLE_MAX_LENGTH = 500

# Maximum characters length of abstract and it`s translation
ABSTRACT_MAX_LENGTH = 1000

# Maximum number of keywords
KEYWORDS_MAX_NUM = 9

# Date and time of registration close
REGISTRATION_CLOSE_DATETIME = datetime(year=2025, month=4, day=5, hour=17, minute=0, second=0)

# Max searching results in "Library" page
MAX_SEARCH_RESULTS = 30

# Opened sections
OPENED_SECTIONS = [
    "Реклама, пиар и медиакоммуникации: современные вызовы и стратегии решения",
    "Массовая коммуникация и окружающий мир",
    "Общество на современном этапе: явления, тренды, процессы",
    "Актуальные проблемы археологии",
    "Актуальные проблемы истории",
    "Актуальные проблемы психологии",
    "Конфликтология, медиация и социальное согласие в эпоху глобализации",
    "Актуальные проблемы физической культуры, спортивного менеджмента и физической реабилитации",
    "Актуальные проблемы развития современного искусства и культуры",
    "Актуальные проблемы философии",
    "Современные тренды дизайна",
    "Православная теология в контексте современной гуманитаристики",
    "Теология и религиоведение: опыт осмысления религиозных культур и субкультур"
]

# Moderators of Sections
MODERATORS = {
    "Реклама, пиар и медиакоммуникации: современные вызовы и стратегии решения": {
        "degree": "к.ф.н.",
        "academic_title": "доцент",
        "job_title": None,
        "job": "ДКМ ШИГН ДВФУ",
        "name": "Баринова Ксения Владимировна"
    },
    "Массовая коммуникация и окружающий мир": {
        "degree": "к.ф.н.",
        "academic_title": "доцент",
        "job_title": None,
        "job": "ДКМ ШИГН ДВФУ",
        "name": "Баринова Ксения Владимировна"
    },
    "Общество на современном этапе: явления, тренды, процессы": {
        "degree": "к.ф.н.",
        "academic_title": "доцент",
        "job_title": None,
        "job": "ДКМ ШИГН ДВФУ",
        "name": "Баринова Ксения Владимировна"
    },
    "Актуальные проблемы археологии": {
        "degree": "к.ф.н.",
        "academic_title": "доцент",
        "job_title": None,
        "job": "ДКМ ШИГН ДВФУ",
        "name": "Баринова Ксения Владимировна"
    },
    "Актуальные проблемы истории": {
        "degree": "к.ф.н.",
        "academic_title": "доцент",
        "job_title": None,
        "job": "ДКМ ШИГН ДВФУ",
        "name": "Баринова Ксения Владимировна"
    },
    "Актуальные проблемы психологии": {
        "degree": "к.ф.н.",
        "academic_title": "доцент",
        "job_title": None,
        "job": "ДКМ ШИГН ДВФУ",
        "name": "Баринова Ксения Владимировна"
    },
    "Конфликтология, медиация и социальное согласие в эпоху глобализации": {
        "degree": "к.ф.н.",
        "academic_title": "доцент",
        "job_title": None,
        "job": "ДКМ ШИГН ДВФУ",
        "name": "Баринова Ксения Владимировна"
    },
    "Актуальные проблемы физической культуры, спортивного менеджмента и физической реабилитации": {
        "degree": "к.ф.н.",
        "academic_title": "доцент",
        "job_title": None,
        "job": "ДКМ ШИГН ДВФУ",
        "name": "Баринова Ксения Владимировна"
    },
    "Актуальные проблемы развития современного искусства и культуры": {
        "degree": "к.ф.н.",
        "academic_title": "доцент",
        "job_title": None,
        "job": "ДКМ ШИГН ДВФУ",
        "name": "Баринова Ксения Владимировна"
    },
    "Актуальные проблемы философии": {
        "degree": "к.ф.н.",
        "academic_title": "доцент",
        "job_title": None,
        "job": "ДКМ ШИГН ДВФУ",
        "name": "Баринова Ксения Владимировна"
    },
    "Современные тренды дизайна": {
        "degree": "к.ф.н.",
        "academic_title": "доцент",
        "job_title": None,
        "job": "ДКМ ШИГН ДВФУ",
        "name": "Баринова Ксения Владимировна"
    },
    "Православная теология в контексте современной гуманитаристики": {
        "degree": "к.ф.н.",
        "academic_title": "доцент",
        "job_title": None,
        "job": "ДКМ ШИГН ДВФУ",
        "name": "Баринова Ксения Владимировна"
    },
    "Теология и религиоведение: опыт осмысления религиозных культур и субкультур": {
        "degree": "к.ф.н.",
        "academic_title": "доцент",
        "job_title": None,
        "job": "ДКМ ШИГН ДВФУ",
        "name": "Баринова Ксения Владимировна"
    }
}

# Data for imprint pages in Collection
COLLECTION_IMPRINT = {
        "УДК": "082",
        "ББК": "94.3",
        "Дата публикации": "01.07.2024",
        "Библиография": {"Заглавие": "Humaniora Forum–2024",
                         "Описание": "сборник трудов ХIII научно-практической конференции студентов и аспирантов",
                         "Город": "Владивосток", "Дата": "26 апреля 2024", "ISBN": "",
                         "URL": "https://www.dvfu.ru/science/publishing-activities/catalogue-of-books-fefu/",
                         "Издательство": {"Город": "Владивосток",
                                          "Название": "Издательство Дальневосточного федерального университета",
                                          "Год": "2024"}},
        "Выпускные данные": {"Название": "Дальневосточный федеральный университет",
                             "Индекс": "690922",
                             "Адрес": "Приморский край, г. Владивосток, о. Русский, п. Аякс, 10",
                             "E-mail": "prudkoglyad.sa@dvfu.ru",
                             "Телефон": "8 (423) 226-54-43",
                             "Copyright": "ФГАОУ ВО ДВФУ",
                             "Год": "2024"},
        "Аннотация": ["В сборнике опубликованы доклады научно-практической конференции студентов и аспирантов, посвященные актуальным проблемам гуманитарных и социальных наук.",
                      "Издание предназначено студентам и аспирантам, преподавателям вузов, а также всем интересующимся данной проблематикой."],
        "Ред. коллегия": [{"ФИО": "П. А. Щербина", "Должность": "канд. ист. наук"},
                          {"ФИО": "К. В. Баринова", "Должность": "канд. филол. наук, доцент"},
                          {"ФИО": "А. В. Здор", "Должность": "канд. филос. наук, доцент"},
                          {"ФИО": "Е. Ю. Костина", "Должность": "канд. социол. наук, доцент"},
                          {"ФИО": "Е. В. Глушак", "Должность": "канд. психол. наук, доцент"},
                          {"ФИО": "О. Ю. Каплун", "Должность": "канд. социол. наук, доцент"},
                          {"ФИО": "А. В. Луценко", "Должность": "канд. филос. наук, доцент"},
                          {"ФИО": "А. В. Чернова", "Должность": "канд. искусствоведения, доцент"},
                          {"ФИО": "О. В. Шакирова", "Должность": "д-р мед. наук, профессор"},
                          {"ФИО": "О. М. Шевчук", "Должность": "канд. ист. наук, доцент"},
                          {"ФИО": "Г. П. Белевщук", "Должность": None}]
    }